backend/models/form/UpdateUser.php

UPDATE `user` SET `auth_key`='70zfm1wNWIgDMxSjl1LAvadv6p8YSdwp', `password_hash`='$2y$13$rq6JhVHSBBcqVZ7xwI6zduzcG.Gb/L./oUXOEg5pFlZj0cLpes7Km', `status`=10, `updated_at`=1493260852 WHERE `id`=7
---
    public function change()
    {
        if ($this->validate()) {
            $user = $this;

            $user->updated_at = time();