common/modules/rbac/models/Menu.php

SELECT `name` FROM `menu`
---
    public function rules()
    {
        return [
            [['name'], 'required'],
            [['parent_name'], 'in',
                'range' => static::find()->select(['name'])->column(),

SELECT `m`.`id`, `m`.`name`, `m`.`route`, `p`.`name` AS `parent_name` FROM `menu` `m` LEFT JOIN `menu` `p` ON `m`.`parent`=`p`.`id`
---
    public static function getMenuSource()
    {
        $tableName = static::tableName();
        return (new \yii\db\Query())
                ->select(['m.id', 'm.name', 'm.route', 'parent_name' => 'p.name'])
                ->from(['m' => $tableName])
                ->leftJoin(['p' => $tableName], '[[m.parent]]=[[p.id]]')
                ->all(static::getDb());