backend/controllers/UserController.php

SELECT * FROM `user` WHERE `id`='7'
---
    public function actionUpdate($id)
    {

        $model = UpdateUser::findOne($id);