common/modules/rbac/controllers/MenuController.php

    protected function findModel($id)
    {
        if (($model = Menu::findOne($id)) !== null) {
---
SELECT * FROM `menu` WHERE `id`='13'